#include "pbdata.h"

void tou()
{
	cout<<"******************************************************************************************"<<'\n';
	cout<<"                                   随机码生成		    	"<<'\n';
	cout<<"******************************************************************************************"<<'\n';
	cout<<"正在进行第"<<zongcishu+1<<" 次随机数生成"<<'\n';
	cout<<"请选择功能键，按回车键结束："<<'\n';
	cout<<'\n';
	cout<<"1、生成0-10 内十位随机数                    2、生成0-10 内任意位随机数"<<'\n';
	cout<<"3、生成任意范围内十位随机数             4、生成任意随机数"<<'\n';
	cout<<"5、查看历史随机数                            6、清除历史数据"<<'\n';
	cout<<"7、退出本系统："<<'\n';
	cout<<"8、附加功能：使用类生成11-20内十位随机数"<<'\n';
	cout<<"9、附加功能：使用链表生成21-30内十位随机数"<<'\n';
}




int fanhui()
{
	cout<<"按数字1返回主菜单：";
	int i;
	cin>>i;
	if(i==1)
		return 1;
	else 
		while(i!=1)
		{
			cout<<"输入错误，请重新输入：";
			cin>>i;
		}
	return 1;
}


void save(int a ,duowei b)
{
	cout<<'\n';
	cout<<"是否将生成的随机码保存至data.txt文件"<<'\n';
	cout<<"确认保存请按1,不保存请按2：";
	int i;
	cin>>i;
	while(i!=1)
		{
			if(i==2)
			{
				cout<<"文本未保存"<<'\n';
				baocun(0,b);
				break;
			}
			cout<<"输入错误，请重新输入：";
			cin>>i;
		}

	if(i==1)
	{
		baocun(a,b);
		cout<<"保存成功"<<'\n';
	}
}


